---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.Classification
source: html/642e56a5-0111-56f9-738e-d4091730132b.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSet.Classification Property

The classification for the mechanical equipment set.

## Syntax (C#)
```csharp
public EquipmentClassification Classification { get; }
```